export const jsonData = {
  code: "00000",
  data: [
    { // 第一页
      regions: [
        {
          location: [
            {
              X: 652,
              Y: 835
            },
            {
              X: 901,
              Y: 822
            },
            {
              X: 906,
              Y: 931
            },
            {
              X: 657,
              Y: 944
            }
          ],
          lines: [
            { // 第一行
              location: [
                {
                  X: 652,
                  Y: 835
                },
                {
                  X: 901,
                  Y: 822
                },
                {
                  X: 906,
                  Y: 931
                },
                {
                  X: 657,
                  Y: 944
                }
              ],
              text: "附件三:"
            },
            {
              location: [
                {
                  X: 1312,
                  Y: 971
                },
                {
                  X: 2355,
                  Y: 976
                },
                {
                  X: 2355,
                  Y: 1089
                },
                {
                  X: 1312,
                  Y: 1084
                }
              ],
              text: "房屋建筑工程质量保修书"
            },
            {
              location: [
                {
                  X: 661,
                  Y: 1317
                },
                {
                  X: 2868,
                  Y: 1327
                },
                {
                  X: 2867,
                  Y: 1455
                },
                {
                  X: 660,
                  Y: 1445
                }
              ],
              text: "发包人(全称): 内蒙古自治区第八地质矿产勘查开发院"
            },
            {
              location: [
                {
                  X: 670,
                  Y: 1516
                },
                {
                  X: 1499,
                  Y: 1520
                },
                {
                  X: 1498,
                  Y: 1619
                },
                {
                  X: 669,
                  Y: 1615
                }
              ],
              text: "承包人(全称):"
            },
            {
              location: [
                {
                  X: 1475,
                  Y: 1515
                },
                {
                  X: 2469,
                  Y: 1520
                },
                {
                  X: 2468,
                  Y: 1619
                },
                {
                  X: 1474,
                  Y: 1614
                }
              ],
              text: "深圳华丽装修家俬企业公司"
            },
            {
              location: [
                {
                  X: 838,
                  Y: 1881
                },
                {
                  X: 2991,
                  Y: 1891
                },
                {
                  X: 2991,
                  Y: 1990
                },
                {
                  X: 838,
                  Y: 1980
                }
              ],
              text: "发包人、承包人根据《中华人民共和国建筑法》《建设工程"
            },
            {
              location: [
                {
                  X: 677,
                  Y: 2064
                },
                {
                  X: 2951,
                  Y: 2075
                },
                {
                  X: 2951,
                  Y: 2175
                },
                {
                  X: 677,
                  Y: 2164
                }
              ],
              text: "质量管理条例》和《房屋建筑工程质量保修办法》,经协商一致,"
            },
            {
              location: [
                {
                  X: 671,
                  Y: 2244
                },
                {
                  X: 2974,
                  Y: 2255
                },
                {
                  X: 2974,
                  Y: 2354
                },
                {
                  X: 671,
                  Y: 2343
                }
              ],
              text: "对地质大厦室内装修第一标段(工程全称)签订工程质量保证书。"
            },
            {
              location: [
                {
                  X: 841,
                  Y: 2429
                },
                {
                  X: 1906,
                  Y: 2434
                },
                {
                  X: 1906,
                  Y: 2534
                },
                {
                  X: 840,
                  Y: 2529
                }
              ],
              text: "一、工程质量保修范围和内容"
            },
            {
              location: [
                {
                  X: 840,
                  Y: 2618
                },
                {
                  X: 2978,
                  Y: 2628
                },
                {
                  X: 2977,
                  Y: 2713
                },
                {
                  X: 839,
                  Y: 2703
                }
              ],
              text: "承包人在质量保修期内,按照有关法律、法规、规章的管理"
            },
            {
              location: [
                {
                  X: 674,
                  Y: 2792
                },
                {
                  X: 2264,
                  Y: 2800
                },
                {
                  X: 2263,
                  Y: 2900
                },
                {
                  X: 673,
                  Y: 2892
                }
              ],
              text: "规定和双方约定,承担本工程质量保修责任。"
            },
            {
              location: [
                {
                  X: 838,
                  Y: 2978
                },
                {
                  X: 2986,
                  Y: 2988
                },
                {
                  X: 2986,
                  Y: 3087
                },
                {
                  X: 838,
                  Y: 3077
                }
              ],
              text: "质量保修范围包括地基基础工程、主体结构工程,屋面防水"
            },
            {
              location: [
                {
                  X: 681,
                  Y: 3166
                },
                {
                  X: 2980,
                  Y: 3177
                },
                {
                  X: 2980,
                  Y: 3262
                },
                {
                  X: 681,
                  Y: 3251
                }
              ],
              text: "工程、有防水要求的卫生间、房间和外墙面的防渗漏,供热与供"
            },
            {
              location: [
                {
                  X: 671,
                  Y: 3341
                },
                {
                  X: 2989,
                  Y: 3352
                },
                {
                  X: 2989,
                  Y: 3451
                },
                {
                  X: 671,
                  Y: 3440
                }
              ],
              text: "冷系统,电气管线、给排水管道、设备安装和装修工程,以及双"
            },
            {
              location: [
                {
                  X: 676,
                  Y: 3520
                },
                {
                  X: 2585,
                  Y: 3529
                },
                {
                  X: 2585,
                  Y: 3629
                },
                {
                  X: 675,
                  Y: 3620
                }
              ],
              text: "方约定的其他项目。具体保修的内容,双方约定如下:"
            },
            {
              location: [
                {
                  X: 747,
                  Y: 3706
                },
                {
                  X: 2977,
                  Y: 3706
                },
                {
                  X: 2977,
                  Y: 3810
                },
                {
                  X: 747,
                  Y: 3810
                }
              ],
              text: "卫生间防水、浴场防水、室内装修、电气管线、给排水管线道。"
            },
            {
              location: [
                {
                  X: 774,
                  Y: 4070
                },
                {
                  X: 1387,
                  Y: 4058
                },
                {
                  X: 1390,
                  Y: 4177
                },
                {
                  X: 776,
                  Y: 4188
                }
              ],
              text: "二、质量保修期"
            },
            {
              location: [
                {
                  X: 2940,
                  Y: 4576
                },
                {
                  X: 3042,
                  Y: 4576
                },
                {
                  X: 3041,
                  Y: 4671
                },
                {
                  X: 2939,
                  Y: 4671
                }
              ],
              text: 70
            },
            {
              location: [
                {
                  X: 3071,
                  Y: 4600
                },
                {
                  X: 3100,
                  Y: 4600
                },
                {
                  X: 3099,
                  Y: 4652
                },
                {
                  X: 3070,
                  Y: 4652
                }
              ],
              text: "."
            }
          ]
        }
      ],
      width: 3572,
      height: 4994,
      currentPage: 1
    }
  ],
  message: "SUCCESS",
  page: "null",
  traceId: "xxxxxxxxxx"
};
